apexrtos/imxrt1060_flashloader/source/drivers/sdmmc/fsl_host.h
/*
 * Copyright (c) 2015 Freescale Semiconductor, Inc.
 * Copyright 2016-2018 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef _FSL_HOST_H
#define _FSL_HOST_H

#include "fsl_common.h"
//#include "board.h"
#include "sdmmc_init.h"
#if defined(FSL_FEATURE_SOC_SDHC_COUNT) && FSL_FEATURE_SOC_SDHC_COUNT > 0U
#include "fsl_sdhc.h"
#elif defined(FSL_FEATURE_SOC_SDIF_COUNT) && FSL_FEATURE_SOC_SDIF_COUNT > 0U
#include "fsl_sdif.h"
#elif defined(FSL_FEATURE_SOC_USDHC_COUNT) && FSL_FEATURE_SOC_USDHC_COUNT > 0U
#include "usdhc/fsl_usdhc.h"
#if (FSL_FEATURE_SOC_IOMUXC_COUNT != 0U)
#include "fsl_iomuxc.h"
#else
#include "fsl_port.h"
#endif
#endif

/*!
 * @addtogroup CARD
 * @{
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/
/* add cache line size align */
#if defined(FSL_SDK_ENABLE_DRIVER_CACHE_CONTROL) && FSL_SDK_ENABLE_DRIVER_CACHE_CONTROL
#if defined(FSL_FEATURE_L1DCACHE_LINESIZE_BYTE)
#if defined(FSL_FEATURE_L2DCACHE_LINESIZE_BYTE)
#define SDMMC_DATA_BUFFER_ALIGN_CAHCE MAX(FSL_FEATURE_L1DCACHE_LINESIZE_BYTE, FSL_FEATURE_L2DCACHE_LINESIZE_BYTE)
#else
#define SDMMC_DATA_BUFFER_ALIGN_CAHCE FSL_FEATURE_L1DCACHE_LINESIZE_BYTE
#endif
#else
#define SDMMC_DATA_BUFFER_ALIGN_CAHCE 1
#endif
#else
#define SDMMC_DATA_BUFFER_ALIGN_CAHCE 1
#endif

#define HOST_NOT_SUPPORT 0U /*!< use this define to indicate the host not support feature*/
#define HOST_SUPPORT 1U     /*!< use this define to indicate the host support feature*/
/* select host */
#if defined(FSL_FEATURE_SOC_SDHC_COUNT) && FSL_FEATURE_SOC_SDHC_COUNT > 0U

/* SDR104 mode freq */
#if defined BOARD_SD_HOST_SUPPORT_SDR104_FREQ
#define HOST_SUPPORT_SDR104_FREQ SD_CLOCK_208MHZ
#else
#define HOST_SUPPORT_SDR104_FREQ SD_CLOCK_208MHZ
#endif
/* HS200 mode freq */
#if defined BOARD_SD_HOST_SUPPORT_HS200_FREQ
#define HOST_SUPPORT_HS200_FREQ MMC_CLOCK_HS200
#else
#define HOST_SUPPORT_HS200_FREQ MMC_CLOCK_HS200
#endif
/* HS400 mode freq */
#if defined BOARD_SD_HOST_SUPPORT_HS400_FREQ
#define HOST_SUPPORT_HS400_FREQ BOARD_SD_HOST_SUPPORT_HS400_FREQ /* host do not support HS400 */
#else
#define HOST_SUPPORT_HS400_FREQ MMC_CLOCK_HS400
#endif

/*define host baseaddr ,clk freq, IRQ number*/
#define MMC_HOST_BASEADDR BOARD_SDHC_BASEADDR
#define MMC_HOST_CLK_FREQ BOARD_SDHC_CLK_FREQ
#define MMC_HOST_IRQ BOARD_SDHC_IRQ
#define SD_HOST_BASEADDR BOARD_SDHC_BASEADDR
#define SD_HOST_CLK_FREQ BOARD_SDHC_CLK_FREQ
#define SD_HOST_IRQ BOARD_SDHC_IRQ

/* define for card bus speed/strength cnofig */
#define CARD_BUS_FREQ_50MHZ (0U)
#define CARD_BUS_FREQ_100MHZ0 (0U)
#define CARD_BUS_FREQ_100MHZ1 (0U)
#define CARD_BUS_FREQ_200MHZ (0U)

#define CARD_BUS_STRENGTH_0 (0U)
#define CARD_BUS_STRENGTH_1 (0U)
#define CARD_BUS_STRENGTH_2 (0U)
#define CARD_BUS_STRENGTH_3 (0U)
#define CARD_BUS_STRENGTH_4 (0U)
#define CARD_BUS_STRENGTH_5 (0U)
#define CARD_BUS_STRENGTH_6 (0U)
#define CARD_BUS_STRENGTH_7 (0U)

#define HOST_TYPE SDHC_Type
#define HOST_CONFIG sdhc_host_t
#define HOST_TRANSFER sdhc_transfer_t
#define HOST_COMMAND sdhc_command_t
#define HOST_DATA sdhc_data_t
#define HOST_BUS_WIDTH_TYPE sdhc_data_bus_width_t
#define HOST_CAPABILITY sdhc_capability_t

#define CARD_DATA0_STATUS_MASK kSDHC_Data0LineLevelFlag
#define CARD_DATA0_NOT_BUSY kSDHC_Data0LineLevelFlag
#define CARD_DATA1_STATUS_MASK kSDHC_Data1LineLevelFlag
#define CARD_DATA2_STATUS_MASK kSDHC_Data2LineLevelFlag
#define CARD_DATA3_STATUS_MASK kSDHC_Data3LineLevelFlag

#define kHOST_DATABUSWIDTH1BIT kSDHC_DataBusWidth1Bit /*!< 1-bit mode */
#define kHOST_DATABUSWIDTH4BIT kSDHC_DataBusWidth4Bit /*!< 4-bit mode */
#define kHOST_DATABUSWIDTH8BIT kSDHC_DataBusWidth8Bit /*!< 8-bit mode */

#define HOST_STANDARD_TUNING_START (0U) /*!< standard tuning start point */
#define HOST_TUINIG_STEP (1U)           /*!< standard tuning step */
#define HOST_RETUNING_TIMER_COUNT (4U)  /*!< Re-tuning timer */
#define HOST_TUNING_DELAY_MAX (0x7FU)
#define HOST_RETUNING_REQUEST (1U)
#define HOST_TUNING_ERROR (2U)

/* function pointer define */
#define HOST_TRANSFER_FUNCTION sdhc_transfer_function_t
#define GET_HOST_CAPABILITY(base, capability) (SDHC_GetCapability(base, capability))
#define GET_HOST_STATUS(base) (SDHC_GetPresentStatusFlags(base))
#define HOST_SET_CARD_CLOCK(base, sourceClock_HZ, busClock_HZ) (SDHC_SetSdClock(base, sourceClock_HZ, busClock_HZ))
#define HOST_SET_CARD_BUS_WIDTH(base, busWidth) (SDHC_SetDataBusWidth(base, busWidth))
#define HOST_SEND_CARD_ACTIVE(base, timeout) (SDHC_SetCardActive(base, timeout))
#define HOST_SWITCH_VOLTAGE180V(base, enable18v)
#define HOST_SWITCH_VOLTAGE120V(base, enable12v)
#define HOST_CONFIG_IO_STRENGTH(speed, strength)
#define HOST_EXECUTE_STANDARD_TUNING_ENABLE(base, flag)
#define HOST_EXECUTE_STANDARD_TUNING_STATUS(base) (0U)
#define HOST_EXECUTE_STANDARD_TUNING_RESULT(base) (1U)
#define HOST_CONFIG_SD_IO(speed, strength)
#define HOST_CONFIG_MMC_IO(speed, strength)
#define HOST_ENABLE_DDR_MODE(base, flag)
#define HOST_FORCE_SDCLOCK_ON(base, enable)
#define HOST_EXECUTE_MANUAL_TUNING_ENABLE(base, flag)
#define HOST_ADJUST_MANUAL_TUNING_DELAY(base, delay)
#define HOST_AUTO_MANUAL_TUNING_ENABLE(base, flag)
#define HOST_ENABLE_CARD_CLOCK(base, enable) (SDHC_EnableSdClock(base, enable))
#define HOST_RESET_TUNING(base, timeout)
#define HOST_CHECK_TUNING_ERROR(base) (0U)
#define HOST_ADJUST_TUNING_DELAY(base, delay)
#define HOST_AUTO_STANDARD_RETUNING_TIMER(base)

#define HOST_ENABLE_HS400_MODE(base, flag)
#define HOST_RESET_STROBE_DLL(base)
#define HOST_ENABLE_STROBE_DLL(base, flag)
#define HOST_CONFIG_STROBE_DLL(base, delay, updateInterval)
#define HOST_GET_STROBE_DLL_STATUS(base)
/* sd card power */
#define HOST_INIT_SD_POWER()
#define HOST_ENABLE_SD_POWER(enable)
#define HOST_SWITCH_VCC_TO_180V()
#define HOST_SWITCH_VCC_TO_330V()
/* mmc card power */
#define HOST_INIT_MMC_POWER()
#define HOST_ENABLE_MMC_POWER(enable)
#define HOST_ENABLE_TUNING_FLAG(data)
#define HOST_CARD_DETECT_INTERRUPT_HANDLER BOARD_SDHC_CD_PORT_IRQ_HANDLER
#define HOST_CARD_DETECT_IRQ BOARD_SDHC_CD_PORT_IRQ

/*! @brief SDHC host capability*/
enum _host_capability
{
    kHOST_SupportAdma = kSDHC_SupportAdmaFlag,
    kHOST_SupportHighSpeed = kSDHC_SupportHighSpeedFlag,
    kHOST_SupportDma = kSDHC_SupportDmaFlag,
    kHOST_SupportSuspendResume = kSDHC_SupportSuspendResumeFlag,
    kHOST_SupportV330 = kSDHC_SupportV330Flag,
    kHOST_SupportV300 = HOST_NOT_SUPPORT,
    kHOST_SupportV180 = HOST_NOT_SUPPORT,
    kHOST_SupportV120 = HOST_NOT_SUPPORT,
    kHOST_Support4BitBusWidth = kSDHC_Support4BitFlag,
    kHOST_Support8BitBusWidth = kSDHC_Support8BitFlag,
    kHOST_SupportDDR50 = HOST_NOT_SUPPORT,
    kHOST_SupportSDR104 = HOST_NOT_SUPPORT,
    kHOST_SupportSDR50 = HOST_NOT_SUPPORT,
    kHOST_SupportHS200 = HOST_NOT_SUPPORT,
    kHOST_SupportHS400 = HOST_NOT_SUPPORT,

