apexrtos/imxrt1060_flashloader/source/drivers/sdmmc/fsl_host.h
/* function pointer define */
#define HOST_TRANSFER_FUNCTION usdhc_transfer_function_t
#define GET_HOST_CAPABILITY(base, capability) (USDHC_GetCapability(base, capability))
#define GET_HOST_STATUS(base) (USDHC_GetPresentStatusFlags(base))
#define HOST_SET_CARD_CLOCK(base, sourceClock_HZ, busClock_HZ) (USDHC_SetSdClock(base, sourceClock_HZ, busClock_HZ))
#define HOST_ENABLE_CARD_CLOCK(base, enable)
#define HOST_FORCE_SDCLOCK_ON(base, enable) (USDHC_ForceClockOn(base, enable))
#define HOST_SET_CARD_BUS_WIDTH(base, busWidth) (USDHC_SetDataBusWidth(base, busWidth))
#define HOST_SEND_CARD_ACTIVE(base, timeout) (USDHC_SetCardActive(base, timeout))
#define HOST_SWITCH_VOLTAGE180V(base, enable18v) (UDSHC_SelectVoltage(base, enable18v))
#define HOST_SWITCH_VOLTAGE120V(base, enable12v)
#define HOST_CONFIG_SD_MUX(base, busWidth) BOARD_SD_MUX_CONFIG(base, busWidth)
#define HOST_UPDATE_SD_IO(base, busWidth, speed, strength) BOARD_SD_IO_UPDATE(base, busWidth, speed, strength)
#define HOST_CONFIG_SD_IO(speed, strength) BOARD_SD_PIN_CONFIG(speed, strength)
#define HOST_CONFIG_MMC_MUX(base, busWidth) BOARD_MMC_MUX_CONFIG(base, busWidth)
#define HOST_UPDATE_MMC_IO(base, busWidth, speed, strength) BOARD_MMC_IO_UPDATE(base, busWidth, speed, strength)
#define HOST_CONFIG_MMC_IO(speed, strength) BOARD_MMC_PIN_CONFIG(speed, strength)
#define HOST_SWITCH_VCC_TO_180V()
#define HOST_SWITCH_VCC_TO_330V()

#if defined(FSL_FEATURE_USDHC_HAS_SDR50_MODE) && (!FSL_FEATURE_USDHC_HAS_SDR50_MODE)
#define HOST_EXECUTE_STANDARD_TUNING_STATUS(base) (0U)
#define HOST_EXECUTE_STANDARD_TUNING_RESULT(base) (1U)
#define HOST_AUTO_STANDARD_RETUNING_TIMER(base)
#define HOST_EXECUTE_STANDARD_TUNING_ENABLE(base, flag)
#define HOST_CHECK_TUNING_ERROR(base) (0U)
#define HOST_ADJUST_TUNING_DELAY(base, delay)
#else
#define HOST_EXECUTE_STANDARD_TUNING_ENABLE(base, flag) \
    (USDHC_EnableStandardTuning(base, HOST_STANDARD_TUNING_START, HOST_TUINIG_STEP, flag))
#define HOST_EXECUTE_STANDARD_TUNING_STATUS(base) (USDHC_GetExecuteStdTuningStatus(base))
#define HOST_EXECUTE_STANDARD_TUNING_RESULT(base) (USDHC_CheckStdTuningResult(base))
#define HOST_AUTO_STANDARD_RETUNING_TIMER(base) (USDHC_SetRetuningTimer(base, HOST_RETUNING_TIMER_COUNT))
#define HOST_EXECUTE_MANUAL_TUNING_ENABLE(base, flag) (USDHC_EnableManualTuning(base, flag))
#define HOST_ADJUST_TUNING_DELAY(base, delay) (USDHC_AdjustDelayForManualTuning(base, delay))
#define HOST_AUTO_TUNING_ENABLE(base, flag) (USDHC_EnableAutoTuning(base, flag))
#define HOST_CHECK_TUNING_ERROR(base) (USDHC_CheckTuningError(base))
#endif

#define HOST_AUTO_TUNING_CONFIG(base) (USDHC_EnableAutoTuningForCmdAndData(base))
#define HOST_RESET_TUNING(base, timeout)                                                           \
    {                                                                                              \
        (USDHC_Reset(base, kUSDHC_ResetTuning | kUSDHC_ResetData | kUSDHC_ResetCommand, timeout)); \
    }

#define HOST_ENABLE_DDR_MODE(base, flag) (USDHC_EnableDDRMode(base, flag, 0U))

#if FSL_FEATURE_USDHC_HAS_HS400_MODE
#define HOST_ENABLE_HS400_MODE(base, flag) (USDHC_EnableHS400Mode(base, flag))
#define HOST_RESET_STROBE_DLL(base) (USDHC_ResetStrobeDLL(base))
#define HOST_ENABLE_STROBE_DLL(base, flag) (USDHC_EnableStrobeDLL(base, flag))
#define HOST_CONFIG_STROBE_DLL(base, delay, updateInterval) (USDHC_ConfigStrobeDLL(base, delay, updateInterval))
#define HOST_GET_STROBE_DLL_STATUS (base)(USDHC_GetStrobeDLLStatus(base))
#else
#define HOST_ENABLE_HS400_MODE(base, flag)
#define HOST_RESET_STROBE_DLL(base)
#define HOST_ENABLE_STROBE_DLL(base, flag)
#define HOST_CONFIG_STROBE_DLL(base, delay, updateInterval)
#define HOST_GET_STROBE_DLL_STATUS(base)
#endif

/* sd card power */
#define HOST_INIT_SD_POWER(base) BOARD_USDHC_SDCARD_POWER_CONTROL_INIT(base)
#define HOST_ENABLE_SD_POWER(base, enable) BOARD_USDHC_SDCARD_POWER_CONTROL(base, enable)
/* mmc card power */
#define HOST_INIT_MMC_POWER(base) BOARD_USDHC_MMCCARD_POWER_CONTROL_INIT(base)
#define HOST_ENABLE_MMC_POWER(base, enable) BOARD_USDHC_MMCCARD_POWER_CONTROL(base, enable)
/* sd card vselect */
#define HOST_INIT_SD_VSEL(base) BOARD_USDHC_SDCARD_VSELECT_INIT(base)
/* mmc card vselect */
#define HOST_INIT_MMC_VSEL(base) BOARD_USDHC_MMCCARD_VSELECT_INIT(base)
/* sd card detect */
#define HOST_CARD_DETECT_STATUS() BOARD_USDHC_CD_STATUS()
#define HOST_CARD_DETECT_INIT() BOARD_USDHC_CD_GPIO_INIT()
#define HOST_CARD_DETECT_INTERRUPT_STATUS() BOARD_USDHC_CD_INTERRUPT_STATUS()
#define HOST_CARD_DETECT_INTERRUPT_CLEAR(flag) BOARD_USDHC_CD_CLEAR_INTERRUPT(flag)
#define HOST_CARD_DETECT_INTERRUPT_HANDLER BOARD_USDHC_CD_PORT_IRQ_HANDLER
#define HOST_CARD_DETECT_IRQ BOARD_USDHC_CD_PORT_IRQ
/* define card detect pin voltage level when card inserted */
#if defined BOARD_USDHC_CARD_INSERT_CD_LEVEL
#define HOST_CARD_INSERT_CD_LEVEL BOARD_USDHC_CARD_INSERT_CD_LEVEL
#else
#define HOST_CARD_INSERT_CD_LEVEL (0U)
#endif
#define HOST_ENABLE_TUNING_FLAG(data) (data.executeTuning = true)
/*! @brief USDHC host capability*/
enum _host_capability
{
    kHOST_SupportAdma = kUSDHC_SupportAdmaFlag,
    kHOST_SupportHighSpeed = kUSDHC_SupportHighSpeedFlag,
    kHOST_SupportDma = kUSDHC_SupportDmaFlag,
    kHOST_SupportSuspendResume = kUSDHC_SupportSuspendResumeFlag,
    kHOST_SupportV330 = kUSDHC_SupportV330Flag, /* this define should depend on your board config */
    kHOST_SupportV300 = kUSDHC_SupportV300Flag, /* this define should depend on your board config */
    kHOST_SupportV180 = kUSDHC_SupportV180Flag, /* this define should depend on you board config */
    kHOST_SupportV120 = HOST_NOT_SUPPORT,
    kHOST_Support4BitBusWidth = kUSDHC_Support4BitFlag,
    kHOST_Support8BitBusWidth = kUSDHC_Support8BitFlag,
    kHOST_SupportDDR50 = kUSDHC_SupportDDR50Flag,
    kHOST_SupportSDR104 = kUSDHC_SupportSDR104Flag,
    kHOST_SupportSDR50 = kUSDHC_SupportSDR50Flag,
    kHOST_SupportHS200 = kUSDHC_SupportSDR104Flag,
#if FSL_FEATURE_USDHC_HAS_HS400_MODE
    kHOST_SupportHS400 = HOST_SUPPORT
#else
    kHOST_SupportHS400 = HOST_NOT_SUPPORT,
#endif
};

/* Endian mode. */
#define USDHC_ENDIAN_MODE kUSDHC_EndianModeLittle

/* DMA mode */
#define USDHC_DMA_MODE kUSDHC_DmaModeAdma2
/* address align */
#define HOST_DMA_BUFFER_ADDR_ALIGN (USDHC_ADMA2_ADDRESS_ALIGN)

/* Read/write watermark level. The bigger value indicates DMA has higher read/write performance. */
#define USDHC_READ_WATERMARK_LEVEL (0x80U)
#define USDHC_WRITE_WATERMARK_LEVEL (0x80U)

/* ADMA table length united as word.
 *
 * One ADMA2 table item occupy two words which can transfer maximum 0xFFFFU bytes one time.
 * The more data to be transferred in one time, the bigger value of SDHC_ADMA_TABLE_WORDS need to be set.
 */
#define USDHC_ADMA_TABLE_WORDS (8U) /* define the ADMA descriptor table length */
#define USDHC_ADMA2_ADDR_ALIGN (4U) /* define the ADMA2 descriptor table addr align size */
#define USDHC_READ_BURST_LEN (8U)   /*!< number of words USDHC read in a single burst */
#define USDHC_WRITE_BURST_LEN (8U)  /*!< number of words USDHC write in a single burst */
#define USDHC_DATA_TIMEOUT (0xFU)   /*!< data timeout counter value */

#endif

/*! @brief host Endian mode
* corresponding to driver define
*/
enum _host_endian_mode
{
    kHOST_EndianModeBig = 0U,         /*!< Big endian mode */
    kHOST_EndianModeHalfWordBig = 1U, /*!< Half word big endian mode */
    kHOST_EndianModeLittle = 2U,      /*!< Little endian mode */
};

#define EVENT_TIMEOUT_TRANSFER_COMPLETE (1000U)
#if defined(BOARD_TIMEOUT_CARD_DETECT)
#define EVENT_TIMEOUT_CARD_DETECT (BOARD_TIMEOUT_CARD_DETECT)
#else
#define EVENT_TIMEOUT_CARD_DETECT (~0U)
#endif

/*******************************************************************************
 * API
 ******************************************************************************/
#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @name adaptor function
 * @{
 */

/*!
 * @brief host not support function, this function is used for host not support feature
 * @param  void parameter ,used to avoid build warning
 * @retval kStatus_Fail ,host do not suppport
 */
static inline status_t HOST_NotSupport(void *parameter)
{
    parameter = parameter;
    return kStatus_Success;
}

/*!
 * @brief Detect card insert, only need for SD cases.
 * @param hostBase the pointer to host base address
 * @retval kStatus_Success detect card insert
 * @retval kStatus_Fail card insert event fail
 */
status_t CardInsertDetect(HOST_TYPE *hostBase);

/*!
 * @brief Init host controller.
 * @param host the pointer to host structure in card structure.
 * @retval kStatus_Success host init success
 * @retval kStatus_Fail event fail
 */
status_t HOST_Init(void *host);

/*!
 * @brief reset host controller.
 * @param host base address.
 */
void HOST_Reset(HOST_TYPE *hostBase);

/*!
 * @brief Deinit host controller.
 * @param host the pointer to host structure in card structure.
 */
void HOST_Deinit(void *host);

/* @} */

#if defined(__cplusplus)
}
#endif

#endif
